{
    "SITE_META_TITLE": "Jérémy Grenet | Freelance front-end developer",
    "SITE_META_DESCRIPTION": "Hi, I'm  Jérémy and I'm a front-end developer.",
    "ACTION_CONTACT_ME": "Get in touch",
    "ACTION_DOWNLOAD_CV": "Download my CV",
    "LOCALE_FR": "Fr",
    "LOCALE_EN": "En",
    "TAB_HOME": "homepage",
    "TAB_SERVICES": "services",
    "TAB_CAREER": "experience",
    "TAB_PRODUCTIONS": "work",
    "TAB_SKILLS": "expertise",
    "TAB_CONTACT": "contact",
    "HOME_HELLO": "Hi!",
    "HOME_NAME": "I'm Jérémy",
    "HOME_JOB": "I'm a <span class='yellow bold'>Front-End</span> developer",
    "HOME_CATCHPHRASE": "Let's see together how to make your projects come true.",
    "SERVICES_ITEM_WEBDEV_TITLE": "Web development",
    "SERVICES_ITEM_WEBDEV_CONTENT": "I assist my clients for the redesign or the creation of their web projects: from the definition of the project until the deployment of the solution. My work is based on the Agile methodology with regular deliveries and client demonstrations throughout the project.",
    "SERVICES_ITEM_MAINTENANCE_TITLE": "Maintenance",
    "SERVICES_ITEM_MAINTENANCE_CONTENT": "Since a project doesn’t stop at the final delivery, I offer an annual maintenance contract to my clients. This contract includes: web hosting costs, bug fixing and updates on the technologies used in order to offer users the best performance.",
    "SERVICES_ITEM_RESPONSIVE_TITLE": "Responsive Web Design",
    "SERVICES_ITEM_RESPONSIVE_CONTENT": "In order to offer the best possible user experience, it is essential to adapt the design of a web app or showcase site to the user’s screen size. My mobile-first development guarantees the right display on any screen resolution.",
    "SERVICES_TAB_TITLE": "My services",
    "CAREER_TAB_TITLE": "Experience",
    "CAREER_TAB_DESCRIPTION": "I graduated from EPITECH in 2019. This 5 years-long academic training as well as its annual mandatory and optional internships taught me autonomy, excellence and professional rigour. After my studies, I joined Infinite Square as a front-end developer with a permanent contract. This company is specialized in the elaboration of web solutions for other companies. These two years at Infinite Square and the diverse projects I worked on there, gave me confidence and many experience.",
    "CAREER_TAB_XP_1": "EPITECH admission",
    "CAREER_TAB_XP_2": "Internships and freelance work",
    "CAREER_TAB_XP_3": "Six-months internship then permament contract at Infinite Square",
    "CAREER_TAB_XP_4": "Graduation from EPITECH",
    "CAREER_TAB_XP_5": "Business creation and launching",
    "PRODUCTIONS_TAB_TITLE": "Work",
    "PRODUCTIONS_TAB_CONTENT": "Over the last 6 years, I worked on, joined and begun numerous projects in diverse contexts: from a personal project to a company project. I decided to list here the most relevant experiences and projects regarding my work as a web developer.",
    "SKILLS_TAB_TITLE": "Expertise",
    "SKILLS_TAB_CONTENT": "I’m coming from a school where continuing education is the keyword. This allowed me to develop my ability to continuously train on new languages and tools over the years. Thanks to that, I now own credentials that meet current needs in web-based projects.",
    "PRODUCTIONS_INFINITE_SQUARE_TITLE": "Infinite Square",
    "PRODUCTIONS_INFINITE_SQUARE_INTRODUCING": "Infinite Square is an enterprise software development company founded in 2010.I joined this company at the end of 2018 as a front-end developer for my final year internship at EPITECH. Then, at the beginning of 2019, I signed a permanent contract there.",
    "PRODUCTIONS_INFINITE_SQUARE_MISSIONS": "My work at Infinite Square over the last 2 years consisted in participating in 8 different projects. Two of these projects lasted more than 6 months and I was positioned at the clients’ offices. I mainly did web integration as well as Javascript development (React for the most part, but also Angular).",
    "PRODUCTIONS_HOKIFISH_SITE_VITRINE_TITLE": "Hokifish - Showcase site",
    "PRODUCTIONS_HOKIFISH_SITE_VITRINE_INTRODUCING": "I participated in this project during my permanent contract at Infinite Square. The aim was to elaborate a showcase site for a product designed by Infinite Square: Hokifish. There, the user can learn more on Hokifish and get in touch with Infinite Square thanks to a contact form in order to know more about it.",
    "PRODUCTIONS_HOKIFISH_SITE_VITRINE_MISSIONS": "The team which elaborated this project was composed of: a webdesigner, a senior front-end developer and myself. The main technical interest of this project was the motion parallax designed with the Skrollr library.",
    "PRODUCTIONS_HOKIFISH_WEB_APP_TITLE": "Hokifish",
    "PRODUCTIONS_HOKIFISH_WEB_APP_INTRODUCING": "I participated in this project during my permanent contract at Infinite Square. The aim of this project was to design a SaaS storage and file sharing product directly linked to the client’s Azure subscription.",
    "PRODUCTIONS_HOKIFISH_WEB_APP_MISSIONS": "For 6 months my task was to take over the front part and develop necessary features for the product’s V2. I mainly worked on the product’s integration of the overall redesign, the development of file sharing features as well as administration tools required for the platform to work. The team was composed of: one PO, one developer, one webdesigner and myself.",
    "PRODUCTIONS_LUMAPPS_TITLE": "Lumapps",
    "PRODUCTIONS_LUMAPPS_INTRODUCING": "I participated in this project during my permanent contract at Infinite Square. The aim of this project was to help Lumapps develop widgets integrating Microsoft Office 365 on their product in order to infiltrate Microsoft’s market. This mission lasted 6 months, during which I was positioned in the client’s offices and fully a member of the development team.",
    "PRODUCTIONS_LUMAPPS_MISSIONS": "My task there was mainly to develop the front-end side of the widgets which incorporated Delve, Planner and Yammer in the company’s product. Another important mission there was to develop the front-end side of a Microsoft Word and PowerPoint plugin enabling the possibility to export content from an Office document to Lumapps’ product. ",
    "PRODUCTIONS_PERNOD_RICARD_LES_EMBIEZ_TITLE": "Les Embiez – Pernod-Ricard",
    "PRODUCTIONS_PERNOD_RICARD_LES_EMBIEZ_INTRODUCING": "I participated in this project during my permanent contract at Infinite Square. The aim of this project was to design a web solution for Pernod-Ricard in order to organize an internal B2B event. The solution is mainly composed of a calendar where people can create meeting slots, invite coworkers, book rooms, and so on.",
    "PRODUCTIONS_PERNOD_RICARD_LES_EMBIEZ_MISSIONS": "One project lead, one webdesigner, 5 back-end developers and 3 front-end developers composed the team working on this project. My work there was to: make some technical choices, boot the front-end part, create and organize the front-end architecture and develop a set of features. The project’s main technical interest was the possibility to use React’s context API for the state management without using Redux or another state management library.",
    "PRODUCTIONS_TALENTSOFT_TITLE": "TalentSoft",
    "PRODUCTIONS_TALENTSOFT_INTRODUCING": "NDA",
    "PRODUCTIONS_TALENTSOFT_MISSIONS": "NDA",
    "PRODUCTIONS_JEREMYGRENET_COM_TITLE": "jeremygrenet.com",
    "PRODUCTIONS_JEREMYGRENET_COM_INTRODUCING": "This is an online portfolio I designed in order to promote my freelancer activity. I made this on my free-time.",
    "PRODUCTIONS_JEREMYGRENET_COM_MISSIONS": "Here I elaborated the design, the Javascript integration as well as the app’s Responsive Web Design. I decided to use Snowpack for the development of this project and MobX as a state management library, combined to React’s context API.",
    "PRODUCTIONS_PINTY_TITLE": "Pinty",
    "PRODUCTIONS_PINTY_INTRODUCING": "This was my final year project at EPITECH. This final year project is called EIP (EPITECH Innovative Project) at EPITECH. This is a three-year project starting on our 3rd year, and ending on our 5th year. Generally speaking, the first year is dedicated to the definition of the need and the project, the creation of the team and the elaboration of a MVP. The two other years are dedicated to the development of the project. For this EIP we elaborated a community platform where the user can get recommendations on places of interest around him according to actions he performed on the platform before (searches, notice and form filing). This concept is very similar to the “Match” feature of Google Maps, which didn’t exist at the time we did our EIP. There was one roadmap for several platforms on this project: iOS (Swift), Android (Java Android) and Web (Angular 5). We developed the API with Node.Js – Express.Js.",
    "PRODUCTIONS_PINTY_MISSIONS": "One lead Web developer, two back-end developers, two Android developers, two iOS developers and one Web developer composed the team on this project. I was the project lead as well as the lead Web developer. Two persons, including me, were in charge of the design. On the project management side, I implemented weekly meetings for all the team. I also took care of refinements, the backlog and the roadmap definition of the project. The Scrum part was handled by the school: sprint definitions, kick-offs organization, deliveries, demos and retrospectives I had to lead. On the design part, my colleague and I both decided on the project’s graphic charter: color palette and logo. We also elaborated the project’s models on mobile and web, as well as the visual display units. We used Adobe Photoshop and Adobe XD for this part. On the Web development side, I took care of the technical decisions, the boot and the architecture of the front-end app. I also integrated most of the web app’s features. Then, I was also in charge of the Responsive Web Design in HTML/CSS for all the Web project.",
    "PRODUCTIONS_MRMARGUERITE_TITLE": "Mr Marguerite",
    "PRODUCTIONS_MRMARGUERITE_INTRODUCING": "I made this project during my few months as a freelance web developer in 2017-2018. The company Mr. Marguerite got in touch with me for the integration of their new landing page.",
    "PRODUCTIONS_MRMARGUERITE_MISSIONS": "On this project, I did all the Responsive Web Design in HTML / CSS of the Photoshop models Mr. Marguerite gave me.",
    "PRODUCTIONS_MEOLIA_TITLE": "Meolia",
    "PRODUCTIONS_MEOLIA_INTRODUCING": "Meolia is a real-estate development and construction company. I worked there as an intern during my 3rd year intership, two days a week. I elaborated a platform which allowed prospects to look for fields listed by Meolia and to budget for the building of a house with Meolia.",
    "PRODUCTIONS_MEOLIA_MISSIONS": "The platform consisted in a field search depending on several criteria (distance with public transportation, price, size, and so on). Once the search is done, the user accesses to a list of fields on a map. Then, he can access information on the different fields and choose a house project. In the end, the user gets a first quote depending on his choices for the project. I was the only one on this project. This means I had to make the technical decisions, define the project’s architecture and make the HTML / CSS and Javascript web integration.",
    "PRODUCTIONS_MGMOBILE_TITLE": "MG Mobile",
    "PRODUCTIONS_MGMOBILE_INTRODUCING":"MG Mobile is an office created in 2013 which is specialized in the elaboration of web and mobile app projects for startups, SMB and big companies. I worked there as an intern during my 1st year and 3rd year internships at EPITECH.",
    "PRODUCTIONS_MGMOBILE_MISSIONS": "I was an intern full-stack developer on several projects during my two internships there. On the front-end side, I was in charge of the Responsive Web Design of several projects. As a back-end developer, I was in charge of the architecture definition, database schemas and SQL scripts for database administration on several projects. My work as a back-end developer also consisted in writing PHP code for HTML pages. Finally, I also took part in acceptance testing on several MG Mobile projects with the elaboration of bug tracking and fixing.",
    "PRODUCTIONS_DETAILS_EXPERIENCETYPE_FULL_TIME": "Full-time contract",
    "PRODUCTIONS_DETAILS_EXPERIENCETYPE_INFINITE_SQUARE_MISSION": " Infinite Square Work / Project",
    "PRODUCTIONS_DETAILS_EXPERIENCETYPE_EPITECH_PROJECT": "EPITECH Project",
    "PRODUCTIONS_DETAILS_EXPERIENCETYPE_FREE_PROJECT": "Free project",
    "PRODUCTIONS_DETAILS_EXPERIENCETYPE_FREELANCE": "Freelance Work / Project ",
    "PRODUCTIONS_DETAILS_EXPERIENCETYPE_INTERNSHIP": "Internship",
    "PRODUCTIONS_DETAILS_ENDDATE_ONGOING": "Ongoing",
    "PRODUCTIONS_DETAILS_PRESENTATION": "Presentation",
    "PRODUCTIONS_DETAILS_MISSIONS": "Work(s)",
    "PRODUCTIONS_DETAILS_SKILLS_AND_TOOLS": "Expertise and tools",
    "CONTACT_SENDING_SUCCESS": "Your message has been sent",
    "CONTACT_SENDING_FAILED": "An error was detected during the sending of your message. Please try again later or get in touch with me via email.",
    "CONTACT_FORM_ERROR_REQUIRED": "This field is required",
    "CONTACT_FORM_ERROR_MAIL_INVALID": "Invalid email address",
    "CONTACT_TAB_TITLE": "Contact",
    "CONTACT_FORM_TITLE": "Contact form",
    "CONTACT_FORM_FIRSTNAME_PLACEHOLDER": "First name",
    "CONTACT_FORM_LASTNAME_PLACEHOLDER": "Last name",
    "CONTACT_FORM_EMAIL_PLACEHOLDER": "Email",
    "CONTACT_FORM_OBJECT_PLACEHOLDER": "Object",
    "CONTACT_FORM_CONTENT_PLACEHOLDER": "Free text",
    "CONTACT_FORM_SUBMIT": "Send",
    "CONTACT_FORM_INFOS": "You can also get in touch with me via",
    "CONTACT_FORM_INFOS_EMAIL": "Email :",
    "CONTACT_FORM_INFOS_PHONE": "Phone :",
    "CONTACT_FORM_NETWORKS": "Find me on LinkedIn :"
}